# Creating DataFrame

It's a 2 dimensional heterogenous data structures. It consists of access, it is nothing but indexes and column.

DataFrame is a container, which is used to hold another container.
DataFrame is a high-level container.

In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({"Column1":[1,2], "Column2":[3,4]})

In [3]:
data

   Column1  Column2
0        1        3
1        2        4

In [6]:
data1 = pd.DataFrame({"Name":["Archana","Sana","Mani","Thiru","Kalpana"],"Age":[21,22,25,27,26],"City":["Salem","Chennai","Coimbatore","Madurai","Trichy"]})

In [7]:
data1

      Name  Age        City
0  Archana   21       Salem
1     Sana   22     Chennai
2     Mani   25  Coimbatore
3    Thiru   27     Madurai
4  Kalpana   26      Trichy

In [8]:
# This is dict of list